{
  "title": "Connect to a VPN in Windows 10",
  "category": "networking",
  "text": "Whether it's for work or personal use, you can connect to a VPN (virtual private network) on your Windows 10 PC. A VPN connection can help provide a more secure connection to your company's network and the Internet (for example, if you're working from a coffee shop or similar public place).\n\nBefore you can connect to a VPN, you must have a VPN profile on your PC. You can either create a VPN profile on your own or set up a work account to get a VPN profile from your company.\n\n**Create a VPN profile**\n\nIf you don't have a VPN profile on your Windows 10 PC, you'll need to create one. \n\n1. Select the  **Start**   button, then select  **Settings**   >  **Network & Internet**   >  **VPN**  >  **Add a VPN connection**.\n2. In  **Add a VPN connection** , do the following:\n  - For  **VPN provider** , choose **Windows (built-in)**. In the Connection name box, type a friendly name (for example, My Personal VPN) for the VPN connection profile. This is the VPN connection name to look for when you try to connect In the Server name or address box. Type the address for the VPN server.\n\n  - For  **VPN type** , choose the type of VPN connection you want to create. You'll need to know which kind of VPN connection your company or VPN service uses.\n\n  - For  **Type of sign-in info** , choose the type of sign-in info (or credentials) to use. This might be a user name and password, one-time password, certificate, or a smart card if you're connecting to a VPN for work. Type your user name and password in the respective boxes (optional).\n3. Select  **Save**.\n4. If you need to edit the VPN connection info or specify additional settings, such as the proxy settings to use for the VPN connection, choose the VPN connection and then select  **Advanced options**.\n\nWhen you have a VPN profile, you're ready to connect.\n\n1. On the far right of the taskbar, select the  **Network**  icon.\n2. Select the VPN connection you want to use, then do either of the following depending on what happens when you select the VPN connection:\n  - If the Connect button displays under the VPN connection, select  **Connect**.\n  - If VPN in Settings opens, select the VPN connection there, then select  **Connect**.\n3. If you're prompted, type your user name and password or other sign-in info.\nWhen connected, the VPN connection name will display Connected underneath it.\n\nTo see if you're connected to the VPN while you're doing things on your PC, select the  **Network**  icon on the far right of the taskbar, then see if the VPN connection says Connected underneath it."
}